constant/dynamicMeshDictRBF
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  5                                     |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      dynamicMeshDict;
}

dynamicFvMesh      dynamicMotionSolverFvMesh;

motionSolverLibs ("libRBFMotionSolver.so");
motionSolver    RBFMotionSolver;
movingPatches (ahmed_body);
staticPatches (inlet outlet ffmaxy ffminy ffmaxz ffminz ahmed_body_front_h ahmed_body_front_v ahmed_stilts);
coarseningRatio 10;

includeStaticPatches   true;
frozenInterpolation    true;

interpolation
{
    RBF W2;
    focalPoint (-0.5 0 0.16);
    innerRadius 0.0;//5.0
    outerRadius 5;
    polynomials true;

    W2Coeffs
    {
        radius     0.5;
    }
    TPSCoeffs
    {
        radius     4;
    }
    GaussCoeffs
    {
        radius     1;
    }
    IMQBCoeffs
    {
        radius     0.1;
    }
}
