system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
|  \\    /   O peration     | Version:  v1712
|   \\  /    A nd           | Web:      www.OpenFOAM.org
|    \\/     M anipulation  |
\*---------------------------------------------------------------------------*/

FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
    vwgSETUP    "2.3.7";
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application         simpleFoam;
startFrom           startTime;
startTime           0;
stopAt              endTime;
endTime             4000;
deltaT              1;
writeControl        runTime;
writeInterval       4000;
purgeWrite          0;
writeFormat         ascii;
writePrecision      10;
writeCompression    compressed;
timeFormat          general;
timePrecision       10;
runTimeModifiable   true;

libs ( "libAMGCSR.so" );

functions
{
    #include    "FOforceCoeffs"
    #include    "FOflowFields"
}

// ************************************************************************* //
