system/decomposeParDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                |
| \      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
|  \    /   O peration     | Version:  2.3.1
|   \  /    A nd           | Web:      www.OpenFOAM.org
|    \/     M anipulation  |
\*---------------------------------------------------------------------------*/

FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      decomposeParDict;
    vwgSETUP    "1.3.0";
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

numberOfSubdomains  16;

method              scotch;

hierarchicalCoeffs
{
    n               ( 240 2 2 );
    delta           0.001;
    order           xyz;
}

//distributed         no;

// ************************************************************************* //
// Copyright of dictionaries and settings by Volkswagen, EKTB/3, 2015.
